{
    "experience": [
        {
            "company": "Programming.com",
            "from": "10/2017",
            "to": "Present",
            "title": "Machine Learning Engineer",
            "environment": ["AWS", "Azure", "Cloudera", "Databricks", "OpenAI chatGPT", "Docker", "Python", "Scala", "Java", "Bash", "SQL"],
            "accomplishments": [
                {
                    "client": "Incyte",
                    "project": "Matchmaker AI",
                    "goal": "Build a RAG system for upper management",
                    "contributions": [
                        "Designed an LLM-based enterprise RAG system that empowered business executives to efficiently search through thousands of internal documents."
                    ]
                },
                {
                    "client": "Incyte",
                    "project": "Vitiligo Tracker",
                    "goal": "Build a segmentation model for detecting vitiligo",
                    "contributions": [
                        "Tracked treatment progress for over 500 vitiligo patients using deep learning and computer vision techniques."
                    ]
                },
                {
                    "client": "Incyte",
                    "project": "Clinical Site Feasibility",
                    "goal": "Build a system to search for appropriate medical facilities to conduct clinical trials",
                    "contributions": [
                        "Accelerated the clinical trial site selection process by 6 months through AI and deep learning methodologies."
                    ]
                },
                {
                    "client": "Takeda",
                    "project": "Patient Complaint Analysis",
                    "goal": "Build a system to generate KPIs on patient complaints about adverse reactions",
                    "contributions": [
                        "Developed an AI-driven application for patient complaint analysis, leveraging NLP and deep learning, resulting in a 40% reduction in manual data processing."
                    ]
                },
                {
                    "client": "Tunespotter",
                    "project": "Audio Recognition",
                    "goal": "Build an audio recognition app, similar to Spotify",
                    "contributions": [
                        "Engineered an audio recognition app using cutting-edge AI embedding technology as a core product for a tech startup."
                    ]
                },
                {
                    "client": "Williams-Sonoma",
                    "project": "Enterprise Data Analytics",
                    "goal": "E-commerce data analytics",
                    "contributions": [
                        "Established a real-time e-commerce analytical system, delivering BI reports promptly and expediting decision-making by over 4 weeks."
                    ]
                },
                {
                    "client": "SAIC Motor",
                    "project": "HMI Climate Control",
                    "goal": "Build an intelligent, personalized in-car climate control system",
                    "contributions": [
                        "Conceptualized an app that automatically adjusts climate controls in cars based on personal preferences, leading to safer and enhanced driving experience."
                    ]
                },
                {
                    "client": "SAIC Motor",
                    "project": "Auto-predict Destination",
                    "goal": "Predict driving destination when car starts",
                    "contributions": [
                        "Pioneered a groundbreaking predictive model using historical geospatial data, enabling next-generation smart cars to accurately anticipate and adapt to drivers' destinations."
                    ]
                    
                },
                {
                    "client": "Tesla",
                    "project": "Generalized Auth Protocol",
                    "goal": "MFA for enterprise-wide security",
                    "contributions": [
                        "Built an centralized MFA system, which standardized software security across the IT infrastructure."
                    ]
                },
                {
                    "client": "Cineo Lighting",
                    "project": "Studio Lighting Control System",
                    "goal": "Build a RaspberryPI based system to control lighting in movie studios",
                    "contributions": [
                        "Designed a fully functional Raspberry-PI based control system that significantly enhanced the efficiency and speed of lighting setup in movie studios."
                    ]
                },
                {
                    "client": "Programming.com",
                    "project": "Leadership and Management",
                    "goal": "Leadership and management",
                    "contributions": [
                        "Mentored and guided more than 10 interns and junior engineers across 5+ projects.",
                        "Led international cross-functional teams of up to 20 developers, successfully delivering 5+ projects.",
                        "Provided technical expertise in implementing and delivering over 12 projects to diverse clients.",
                        "Played a pivotal role in establishing and nurturing long-term business relationships with 3 different clients."
                    ]
                }
            ]
        },

        {
            "company": "Huawei",
            "from": "03/2017",
            "to": "03/2017",
            "title": "Data Scientist",
            "environment": ["Cloudera Hadoop", "FusionInsight", "Spark", "java", "python"],
            "accomplishments": [
                {
                    "project": "Energy Consumption Model",
                    "goal": "",
                    "contributions": [
                        "Developed a robust system for estimating energy consumption in data centers, resulting in optimized resource allocation."
                    ]
                },
                {
                    "project": "TPC-Express",
                    "goal": "Benchmark for big data systems",
                    "contributions":[
                        "Significantly enhanced the efficiency of next-generation data centers (DC 3.0) by implementing AI-driven strategies, leading to reduced operational costs and improved performance.",
                        "Key contributor in establishing the industry-standard TPCx-IoT benchmark, facilitating fair and accurate performance comparisons across IoT platforms."
                    ]
                }
            ]
        },

        {
            "company": "Comcast",
            "from": "05/2015",
            "to": "08/2016",
            "title": "Big Data Engineer",
            "environment": ["Hortonworks Hadoop", "MapReduce", "Hive", "HBase", "Sqoop", "Apache Spark", "Kafka", "Teradata", "Oracle", "GridGain", "Django", "Automic UC4"],
            "accomplishments": [
                {
                    "project": "Enterprise analytics",
                    "goal": "Data engineering",
                    "contributions": [
                        "Modernized the enterprise system managing 20+ petabytes of data using big data technologies, resulting in a 30\\% reduction in operational costs."
                    ]
                },
                {
                    "project": "Datacast",
                    "goal": "Xfinity targeted ad campaigns",
                    "contributions": [
                        "Designed an application to deliver targeted promotional offers based on customer behaviour."
                    ]
                }
            ]
        },

        {
            "company": "Qualcomm",
            "from": "04/2014",
            "to": "03/2015",
            "title": "Security Software Engineer",
            "environment": ["Python", "C/C++", "Django", "Cherrypy", "AngularJS", "MySQL", "Android SDK", "Android kernel", "ARM TrustZone"],
            "accomplishments": [
                {
                    "project": "SecOTA",
                    "goal": "Securely deliver upgrades to Snapdragon chipset users over the air",
                    "contributions": [
                        "Developed an application for secure over-the-air (OTA) firmware upgrades, ensuring reliable and efficient delivery to end users."
                    ]
                },
                {
                    "project": "Scanban",
                    "goal": "Code vulnerability scanner",
                    "contributions": [
                        "Introduced an algorithm to automatically scan code repositories and report security vulnerabilities."
                    ]
                }
            ]
        },

        {
            "company": "Carolinas Healthcare System",
            "from": "05/2013",
            "to": "12/2013",
            "title": "Research Engineer",
            "environment": ["Yaskava", "Microsoft Excel", "NI DAQ", "C", "Python"],
            "accomplishments": [
                {
                    "project": "Spasticity detection",
                    "goal": "Quantify Spasticity in elbow of Parkinson's patients",
                    "contributions": [
                        "Implemented an algorithm to accurately measure the severity of Parkinson's disease, improving diagnostic precision.",
                        "Devised a robotic arm for patient measurements and treatment analysis."
                    ]
                }
            ]
        }
    ]
}