[
    {
        "company": "Self-Employed",
        "from": "05/2025",
        "to": "Present",
        "title": "Freelance Consultant",
        "accomplishments": [
            "Spearhead diverse project implementations by leveraging a wide spectrum of advanced technical skills across applied ML, AI, Data Science, Deep Learning, data engineering, Python, and full stack development.",
            "Demonstrated the ability to navigate complex projects independently from conceptualization to execution, ensuring robust, scalable solutions in emerging technological domains.",
            "Employed strategic problem-solving methodologies to deliver high-impact solutions that meet client needs while adapting to rapidly evolving market demands.",
            "Managed multi-faceted assignments with agility and resourcefulness, establishing a foundation for long-term consulting success across various industries."
        ]
    },

    {
        "company": "Programming.com",
        "from": "10/2017",
        "to": "09/2024",
        "title": "Data / AI Expert",
        "accomplishments": [
            "Leveraged expertise in Data Science, Data Engineering, Machine Learning, and Artificial Intelligence to deliver innovative solutions to various clients and customers.",
            "Served as a technical expert in client meetings, aiding in project acquisitions and offering on-the-fly problem-solving suggestions.",
            "Assumed responsibility for setting project requirements, designing application architecture, assembling teams, and leading the implementation of projects.",
            "Mentored and guided more than 10 interns and junior engineers across 5+ projects.",
            "Led international cross-functional teams of up to 20 developers, successfully delivering 5+ projects.",
            "Provided technical expertise in implementing and delivering over 12 projects to clients from diverse industries.",
            "Played a pivotal role in establishing and nurturing long-term business relationships with 3 different clients."
        ]
    },

    {
        "company": "Huawei",
        "from": "03/2017",
        "to": "06/2017",
        "title": "Data Scientist",
        "accomplishments": [
            "Collaborated with Netowrking Research department to improve Futurewei Data Center products and services.",
            "Key contributor in establishing open source TPCx-IoT benchmark, facilitating fair and accurate performance comparisons.",
            "Significant contributor in authoring and publishing a research paper and an industry-wide specification."
        ]
    },

    {
        "company": "Comcast Cable",
        "from": "05/2015",
        "to": "08/2016",
        "title": "Big Data Engineer",
        "accomplishments":[
            "Worked with the data services team to implement backend processes with cutting-edge big data technologies.",
            "Migrated tech stack for processing 20+ petabytes of data, reducing operating costs by 30%.",
            "Delivered targeted promotional offers to millions of Xfinity customers."
        ]
    },

    {
        "company": "Qualcomm",
        "from": "04/2014",
        "to": "03/2015",
        "title": "Software Engineer",
        "accomplishments":[
            "Joined forces with software security team to implement kernel level security features in Android smartphones.",
            "Delivered over-the-air (OTA) firmware upgrades securely, ensuring reliable and efficient delivery to end users.",
            "Automated the identification of security vulnerabilities code repositories across the enterprise."
        ]
    },

    {
        "company": "Carolinas Healthcare System",
        "from": "05/2013",
        "to": "12/2013",
        "title": "Research Engineer",
        "accomplishments":[
            "Partnered with research wing as part of Master's thesis",
            "Implemented an algorithm to accurately measure the severity of Parkinson's disease, improving diagnostic precision.",
            "Devised a prototype robotic device for patient measurements, which helped in creating personamlized treatment plans."
        ]
    }
]