{
    "introduction": "Welcome to my portfolio! I specialize in driving transformation through cutting-edge AI, machine learning, and big data technologies, catering to both established enterprises and dynamic startups. With a proven track record of designing and implementing AI-driven systems, I empower businesses to unlock new levels of efficiency, insight, and innovation. From real-time analytics and intelligent document management to predictive analytics, data engineering, and core product development, my expertise helps organizations navigate the complexities of modern technology and achieve their strategic goals. Let’s revolutionize your business together.",
    "keywords": ["Artificial Intelligence", "Machine Learning", "Data Science", "Big Data", "Software Engineering", "Full Stack", "Computer Science"],
    "bullets": [
        {
            "header": "ML/AI Expertise",
            "point": "Deliver tailored solutions in ML, AI, MLOps, Deep Learning, Data Science, Computer Vision, NLP, and LLMs."
        },

        {
            "header": "Data Solutions",
            "point": "Design and implement data solutions at petabyte scale, ensuring robust and scalable data handling capabilities."
        },

        {
            "header": "Industry Impact",
            "point": "Over 10 years experience as a consultant working with startups and enterprises in healthcare, automotive, technology, banking, e-coomerce industries, and successfully transitioning into freelance consulting career.",
            "point_old": "Successfully implemented data driven applications at businesses ranging from startups to large enterprises in diverse sectors such as healthcare, automotive, banking, technology, and e-commerce."
        },

        {
            "header": "Strategic Leadership",
            "point": "Guiding cross-functional teams, mentoring emerging talent, engaging stakeholders, solution proposals, strategic planning to consistently deliver high-quality work.",
            "point_old": "Guided cross-functional teams, mentored junior members, engaged in stakeholder meetings for project acquisitions and proposals, and consistently delivered high-quality work."
        },

        {
            "header": "Adaptive Mindset",
            "point": "Resilient professional with a proven ability to adapt to changing environments, incorporating innovative methodologies and leveraging new technologies to stay ahead in the field.",
            "point_old": "Quick learner with a proven ability to adapt to changing organizational goals and incorporate innovative methodologies."
        }
    ]
}